extension/InformationRegisters/КалендарьЗаписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КалендарьЗаписей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВизита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/Documents/ЗаписьНаУслугу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗаписьНаУслугу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КалендарьЗаписей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВизита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

extension/InformationRegisters/КалендарьЗаписей/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьЗаписиРегистра() Экспорт
    // Создаем выборку из регистра сведений
    Выборка = РегистрыСведений.КалендарьЗаписей.Выбрать();
    
    Результат = Новый СписокЗначений;
    
    Пока Выборка.Следующий() Цикл
        // Добавляем записи в результат
        Запись = Новый Структура;      
		
        Запись.Вставить("Регистратор", Выборка.Регистратор);
        Запись.Вставить("Клиент", Выборка.Клиент);
        Запись.Вставить("ДатаВизита", Выборка.ДатаВизита);
        Запись.Вставить("Мастер", Выборка.Мастер);
        Запись.Вставить("Услуга", Выборка.Услуга);
        Запись.Вставить("Статус", Выборка.Статус);
        Запись.Вставить("Длительность", Выборка.Длительность);
        Результат.Добавить(Запись);
    КонецЦикла;
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОбновитьПланировщик(ДополнительныеПараметры, Результат) Экспорт
	// Загружаем данные из регистра
	Записи = ПолучитьЗаписиРегистра();
	
	Планировщик.Элементы.Очистить();
	Для Каждого Запись Из Записи Цикл
		Элемент = Планировщик.Элементы.Добавить(Запись.Значение.ДатаВизита, Запись.Значение.ДатаВизита +  Запись.Значение.Длительность * 60);
		Элемент.Текст = Строка(Запись.Значение.Услуга) + " - " + Строка(Запись.Значение.Клиент) + " мастер: " + Строка(Запись.Значение.Мастер);
   		Элемент.Значение = Запись.Значение.Регистратор;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	// Загружаем данные из регистра
	Записи = ПолучитьЗаписиРегистра();
	
	Планировщик.Элементы.Очистить();
	Для Каждого Запись Из Записи Цикл
		Элемент = Планировщик.Элементы.Добавить(Запись.Значение.ДатаВизита, Запись.Значение.ДатаВизита +  Запись.Значение.Длительность * 60);
		Элемент.Текст = Строка(Запись.Значение.Услуга) + " - " + Строка(Запись.Значение.Клиент) + " мастер: " + Строка(Запись.Значение.Мастер);
   		Элемент.Значение = Запись.Значение.Регистратор;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытиеФормыЗаписи" Тогда
		ПриОткрытии(Ложь);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикЗаписейПередУдалением(Элемент, Отказ)
	
	Если Не Отказ Тогда
		ОчисткаЗаписи(Элемент.ВыделенныеЭлементы[0].Значение);
	КонецЕсли;
	
КонецПроцедуры         

&НаСервере
Процедура ОчисткаЗаписи(Запись)
	
	ДокументОбъект = Запись.ПолучитьОбъект();	
	ДокументОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПланировщикЗаписейПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Запись = Новый Структура;      
	Запись.Вставить("Дата", ТекущаяДата());
	Запись.Вставить("ДатаВизита", Начало); 
	//Запись.Вставить("Ключ", Элемент.ВыделенныеЭлементы[0].Значение); 
	
	ОткрытьФорму("Документ.ЗаписьНаУслугу.Форма.ФормаДокумента", Запись, ЭтотОбъект, , , ,Новый ОписаниеОповещения("ОбновитьПланировщик", ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
	Планировщик.КратностьПериодическогоВарианта = 12;
	
	//Планировщик.Измерения.Добавить("Клиент", "Клиент");
	//Планировщик.Измерения.Добавить("Услуга", "Услуга");
	//Планировщик.Измерения.Добавить("Мастер", "Мастер");
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикЗаписейПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;    

	ОткрытьФорму("Документ.ЗаписьНаУслугу.Форма.ФормаДокумента", Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение), ЭтотОбъект, , , ,Новый ОписаниеОповещения("ОбновитьПланировщик", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикЗаписейВыбор(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Дни(Команда)
	Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.День;
	Планировщик.КратностьПериодическогоВарианта = 0.1;
	ПриОткрытии(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Часы(Команда)
	Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
    Планировщик.КратностьПериодическогоВарианта = 12;
	ПриОткрытии(Ложь);
КонецПроцедуры
